In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime
from datetime import date,timedelta
from datetime import date

In [6]:
df_cab = pd.read_csv('Cab_Data.csv')
df_city = pd.read_csv('City.csv')
df_cusid = pd.read_csv('Customer_ID.csv')
df_transid = pd.read_csv('Transaction_ID.csv')
df_holiday= pd.read_csv('Holiday.csv')
df_holiday

     Date of Travel  Holiday?
0          2016/1/2         1
1          2016/1/3         1
2          2016/1/4         0
3          2016/1/5         0
4          2016/1/6         0
...             ...       ...
1090     2018/12/27         0
1091     2018/12/28         0
1092     2018/12/29         1
1093     2018/12/30         1
1094     2018/12/31         1

[1095 rows x 2 columns]

In [3]:
for i in range(359392):
    df_cab['Date of Travel'][i] = date(1900,1,1)+timedelta(int(df_cab['Date of Travel'][i])-2)
df_cab = df_cab.merge(df_holiday,how='left',on='Date of Travel')
df_cab.head()

C:\Users\Ruizhe Zhang\AppData\Local\Temp/ipykernel_32684/480156225.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cab['Date of Travel'][i] = date(1900,1,1)+timedelta(int(df_cab['Date of Travel'][i])-2)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Holiday?
0,10000011,2016-01-08,Pink Cab,ATLANTA GA,30.45,370.95,313.635,NaN
1,10000012,2016-01-06,Pink Cab,ATLANTA GA,28.62,358.52,334.854,NaN
2,10000013,2016-01-02,Pink Cab,ATLANTA GA,9.04,125.20,97.632,NaN
3,10000014,2016-01-07,Pink Cab,ATLANTA GA,33.17,377.40,351.602,NaN
4,10000015,2016-01-03,Pink Cab,ATLANTA GA,8.73,114.62,97.776,NaN

In [4]:
df1 = df_cab.merge(df_transid, how='left', on='Transaction ID').merge(df_cusid, how='left', on='Customer ID').dropna()
df1['Revenue']=df1['Price Charged']-df1['Cost of Trip']
df1.head()

Empty DataFrame
Columns: [Transaction ID, Date of Travel, Company, City, KM Travelled, Price Charged, Cost of Trip, Holiday?, Customer ID, Payment_Mode, Gender, Age, Income (USD/Month), Revenue]
Index: []

In [5]:
df_tmp = df1[['City','KM Travelled','Price Charged','Revenue']].groupby(by='City').sum()
df_tmp
df_tmp['Number of Rides'] = df1.groupby(by='City').count()['Transaction ID']
df2 = df_city.merge(df_tmp,how='left',on='City').set_index('City').dropna()
df2['Avg Revenue'] = df2['Revenue']/df2['Number of Rides']
df2

Empty DataFrame
Columns: [Population, Users, KM Travelled, Price Charged, Revenue, Number of Rides, Avg Revenue]
Index: []